resume.org
#+OPTIONS: toc:nil H:10

#+LaTeX_HEADER: \usepackage{mycv}

#+LaTeX_HEADER: \newcommand{\tab}{\hspace*{2em}}

#+MACRO: first  Reuben
#+MACRO: last   Peter-Paul
#+MACRO: full {{{first}}} {{{last}}}
#+MACRO: email reuben.peterpaul@gmail.com
#+MACRO: phone  (506) 447-0612
#+MACRO: homepage [[http://re.vu/reubenPeterPaul][re.vu/reubenPeterPaul]]
#+MACRO: projects [[github.com/reubenPeterPaul][github.com/reubenPeterPaul]]
#+MACRO: linkedin [[http://linkedin.com/in/reubenpeterpaul][LinkedIn.com/in/reubenPeterPaul]]
#+MACRO: twitter [[https://twitter.com/reubenPeterPaul][twitter.com/reubenPeterPaul]]

#+TITLE: \textbf{Reuben Peter-Paul, MCS}\\\emph{\Large{Computing Scientist and Software Engineer}}

* Contact Information
** Email
{{{email}}}
** Mobile
{{{phone}}}
** Homepages
{{{homepage}}}, {{{linkedin}}}

* Work Experience
** May 2012 - /Present/
*Senior Software Engineer*, [[http://ipsnp.wikidot.com/][IPSNP Computing Inc.]], Saint John, New Brunswick

I work (part-time) as a programmer for IPSNP Computing Inc., where I am involved in
the development of semantic web technologies applied to bio-informatics and
clinical intelligence.
#+BEGIN_QUOTE
/[[software engineering]], [[Programming Languages][logic programming]], [[Authoring][context free grammars]], [[systems scripting]] and [[integration]]/
#+END_QUOTE
** March 2012 - /Present/
*Information and Communications Technology Officer*, [[http://awdi-nb.com][Aboriginal Workforce Development Initiative]], Fredericton, New Brunswick

As Information and Communications Technology (ICT) Officer, I am involved in the
design, implementation and execution of a federally funded project directed at the
development of a specialized /training-to-employment/ program called the
New Brunswick Aboriginal Information and Communications Technology ([[http://awdi-nb.org/ict.html][NBAICT]]) project.

#+BEGIN_QUOTE
/partnership building, curricula design, marketing, public speaking, [[statistical analysis]]/
#+END_QUOTE

** February 2009 - February 2012
*Prototype Development Specialist*, [[http://www.nrc-cnrc.gc.ca][National Research Council]], Fredericton, New Brunswick

As a programmer at the National Research Council, I worked in teams consisting of
other NRC Prototype Development Specialists, Research Officers, Business Development Officers,
and Industry partners.

Three major projects I participated in were:

 * *REM*, dose registry and radiation exposure management platform.
 * *OmniBid*, open system for many-to-many automated negotiation platform.
 * *[[http://www.redballinternet.ca/advanced-gps-tracking-onboard-connectivity/all-about-trax][Trax]]*, automatic vehicle location platform.

#+BEGIN_QUOTE
/[[software engineering]], [[scripting]], [[automation][build automation]], [[automation][release management]], [[database management]], [[mobile application development]], [[automation][continuous integration]], [[software engineering][agile]], [[Authoring][architecture and design]]/
#+END_QUOTE

** May 2008 - February 2009
*Software Consultant*, [[http://www.accreon.com][Accreon]], Fredericton, New Brunswick

I was hired as a software consultant to participate in a small team to redesign a software product for an existing client.
# I was involved in the redesign of several important business and information processes and then tasked to implement them.
#I was also responsible for managing releases of the product.
#+BEGIN_QUOTE
/[[software engineering]], [[scripting]], [[automation][build automation]], [[automation][release management]], [[database management]]/
#+END_QUOTE

** January 2006 - April 2008
*Research Assistant*, [[http://www.cs.unb.ca][Faculty of Computer Science]], [[http://www.unb.ca][University of New Brunswick]], Fredericton, New Brunswick

I was involved in the development of a new structural representational formalism, the Evolving Transformation System (ETS).
#My activities as member of the ETS group included: development and formalization of new ETS concepts;
#collaborating on research papers for publication and conferences; and drafting technical drawings for data visualization,
#technical papers, posters and presentations.
#I also participated in a short prototyping project, with my co-supervisor Dr. Du, involving the development of custom software for the Sony Playstation Portable (PSP).
#+BEGIN_QUOTE
/knowledge representation, computational theory, data visualization, symbolic computation, [[software engineering]]/
#+END_QUOTE


** January 2006 - April 2008
*Teaching Assistant*, [[http://www.cs.unb.ca][Faculty of Computer Science]], [[http://www.unb.ca][University of New Brunswick]], Fredericton, New Brunswick

I assisted in class labs and I marked assignments for several introductory, intermediate and advanced subjects in computer science.

#, e.g.: basic programming, Internet technologies, design patterns, and software architecture.

** May 2005 - December 2005
*Software Developer*, Isomni Solutions Inc., Fredericton, New Brunswick

I developed an e-learning course management solution (iLearn).  I also designed and developed web-based user interface and a reference manual.

* Education
** December 2006 - May 2009
*Master of Computer Science*, Specializing in data representation and visualization for pattern recognition and machine learning.

** Institution
University of New Brunswick

** September 2000 - May 2005
*Bachelor of Computer Science*, [[http://www.unb.ca/fredericton/cs/undergrad/bcs/index.html][Co-op]], Honours and designated Major in Software Systems

** Institution
University of New Brunswick

* Active Projects
** RuleML PSOA
I am an active contributor to the [[http://ruleml.org/#PSOA][RuleML PSOA specification]] as part of the [[http://reubenpeterpaul.github.com/PSOA-to-TPTP/][PSOA2TPTP]] project.

* Selected Technical Skills and Abilities

** Programming Languages

/General:/
   Java, Haskell, Lisp, Clojure, C/C++, Objective-C

/Logic:/
   Prolog, JBoss Drools, PSOA RuleML

#<<systems scripting>>
#<<scripting>>

/Markup:/
   HTML5, LaTeX, Markdown, Restructured Text, HAML, SASS

/Scripting:/
   JavaScript, Ruby, PL/SQL, BASH


#+BEGIN_QUOTE
/Learning: Clojure, Erlang, Scala/
#+END_QUOTE


**  Software Engineering
#<<architecture>>
#<<API>>
#<<integration>>
#<<software engineering>>

/Architectural Styles:/
    REST, Web Services, Message Queue, MVC, Pipeline

/Development Methodologies:/
    Agile, Extreme Programming (XP), Scrum, TDD/BDD

/APIs:/
    J2EE, JAX-RS, JPA, JMS, Java Servlet, OSGI, JADE

/Frameworks:/
    jQuery, Rails, Flex, Adhearsion, Jersey, RESTEasy, ANTLR, Parsec

#<<mobile application development>>

/Mobile Platform:/
iOS, Android

#- Automated Testing :: xUnit, Cucumber, Mockito, RSpec
#<<automation>>

/Automation:/
Jenkins, Maven, Ant, Automake, xUnit, Cucumber, RSpec

#, Rake, Capistrano, Leiningen
#<<telephony>>

/Telephony:/ Asterisk, Festival TTS

#** Programming Theory
#- [[http://en.wikipedia.org/wiki/Programming_paradigm][Paradigms]] :: Object-Oriented (OOP), Function (FP), Metaprogramming
#- Theory :: (Typed/Untyped) \lambda Calculus, \pi Calculus

** Servers
/Web:/ Apache HTTP, Tomcat, Mongrel, Node.js, Jetty, Snap

/Stacks:/ JBoss, JMX, Equinox, SpringSource dm Server, JADE

/Telephony:/ Asterisk

#<<database management>>

/Database:/ MySQL, Oracle, PostgreSQL, SQLite, MongoDB, BigTable

/Version Control:/ Git, Subversion

/Repository:/ Apache Ivy, Sonatype Nexus


** Authoring
/Code:/ emacs, vim, eclipse, Xcode, Matlab

/Text:/ Org Mode, ScribTeX, Sphinx
#<<statistical analysis>>

/Statistical Analysis:/ Org-R, R

/Diagrams:/ Graphviz, UMLet, Visio

* Personal Information

** Interests and Hobbies

- Personal :: family, hunting, archery, chess, snow boarding, board games, music

- Professional :: emacs, functional programming, web APIs, cloud computing, security

- Scientific :: category theory, \lambda calculus, \pi calculus, proof-carrying code, knowledge/data visualization

** Source Code Repositories

[[https://github.com/reubenPeterPaul][GitHub]], [[http://code.google.com/u/101676264568220935370/][Google Code]]


* Awards and Recognition
** May 2010
   *KIRA, Technological Advancement and Innovation in the Private Sector*, our team was recognized for our automatic vehicle location platform developed in partnership with [[http://redballinternet.com][Red Ball Internet]].

** August 2008
   *Post Secondary Education Achievement*, I was recognized by the Pabineau First Nation community for successfully obtaining a master's degree in Computer Science.

* References
/Available upon request./
