resume.tex
% Created 2012-09-20 Thu 09:38
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{mycv}
\newcommand{\tab}{\hspace*{2em}}
\providecommand{\alert}[1]{\textbf{#1}}

\title{\textbf{Reuben Peter-Paul, MCS}\\\emph{\Large{Computing Scientist and Software Engineer}}}
\author{Reuben Peter-Paul}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle






\section{Contact Information}
\label{sec-1}
\subsection{Email}
\label{sec-1-1}

reuben.peterpaul@gmail.com
\subsection{Mobile}
\label{sec-1-2}

(506) 447-0612
\subsection{Homepages}
\label{sec-1-3}

\href{http://re.vu/reubenPeterPaul}{re.vu/reubenPeterPaul}, \href{http://linkedin.com/in/reubenpeterpaul}{LinkedIn.com/in/reubenPeterPaul}
\section{Work Experience}
\label{sec-2}
\subsection{May 2012 - \emph{Present}}
\label{sec-2-1}

\textbf{Senior Software Engineer}, \href{http://ipsnp.wikidot.com/}{IPSNP Computing Inc.}, Saint John, New Brunswick

I work (part-time) as a programmer for IPSNP Computing Inc., where I am involved in
the development of semantic web technologies applied to bio-informatics and
clinical intelligence.
\begin{quote}
\emph{\hyperref[sec-5-2]{software engineering}, \hyperref[sec-5-1]{logic programming}, \hyperref[sec-5-4]{context free grammars}, \hyperref[systems-scripting]{systems scripting} and \hyperref[sec-5-2]{integration}}
\end{quote}
\subsection{March 2012 - \emph{Present}}
\label{sec-2-2}

\textbf{Information and Communications Technology Officer}, \href{http://awdi-nb.com}{Aboriginal Workforce Development Initiative}, Fredericton, New Brunswick

As Information and Communications Technology (ICT) Officer, I am involved in the
design, implementation and execution of a federally funded project directed at the
development of a specialized \emph{training-to-employment} program called the
New Brunswick Aboriginal Information and Communications Technology (\href{http://awdi-nb.org/ict.html}{NBAICT}) project.

\begin{quote}
\emph{partnership building, curricula design, marketing, public speaking, \hyperref[statistical-analysis]{statistical analysis}}
\end{quote}
\subsection{February 2009 - February 2012}
\label{sec-2-3}

\textbf{Prototype Development Specialist}, \href{http://www.nrc-cnrc.gc.ca}{National Research Council}, Fredericton, New Brunswick

As a programmer at the National Research Council, I worked in teams consisting of
other NRC Prototype Development Specialists, Research Officers, Business Development Officers,
and Industry partners.

Three major projects I participated in were:

\begin{itemize}
\item \textbf{REM}, dose registry and radiation exposure management platform.
\item \textbf{OmniBid}, open system for many-to-many automated negotiation platform.
\item \textbf{\href{http://www.redballinternet.ca/advanced-gps-tracking-onboard-connectivity/all-about-trax}{Trax}}, automatic vehicle location platform.
\end{itemize}

\begin{quote}
\emph{\hyperref[sec-5-2]{software engineering}, \hyperref[scripting]{scripting}, \hyperref[automation]{build automation}, \hyperref[automation]{release management}, \hyperref[database-management]{database management}, \hyperref[mobile-application-development]{mobile application development}, \hyperref[automation]{continuous integration}, \hyperref[sec-5-2]{agile}, \hyperref[sec-5-4]{architecture and design}}
\end{quote}
\subsection{May 2008 - February 2009}
\label{sec-2-4}

\textbf{Software Consultant}, \href{http://www.accreon.com}{Accreon}, Fredericton, New Brunswick

I was hired as a software consultant to participate in a small team to redesign a software product for an existing client.
\begin{quote}
\emph{\hyperref[sec-5-2]{software engineering}, \hyperref[scripting]{scripting}, \hyperref[automation]{build automation}, \hyperref[automation]{release management}, \hyperref[database-management]{database management}}
\end{quote}
\subsection{January 2006 - April 2008}
\label{sec-2-5}

\textbf{Research Assistant}, \href{http://www.cs.unb.ca}{Faculty of Computer Science}, \href{http://www.unb.ca}{University of New Brunswick}, Fredericton, New Brunswick

I was involved in the development of a new structural representational formalism, the Evolving Transformation System (ETS).
\begin{quote}
\emph{knowledge representation, computational theory, data visualization, symbolic computation, \hyperref[sec-5-2]{software engineering}}
\end{quote}
\subsection{January 2006 - April 2008}
\label{sec-2-6}

\textbf{Teaching Assistant}, \href{http://www.cs.unb.ca}{Faculty of Computer Science}, \href{http://www.unb.ca}{University of New Brunswick}, Fredericton, New Brunswick

I assisted in class labs and I marked assignments for several introductory, intermediate and advanced subjects in computer science.
\subsection{May 2005 - December 2005}
\label{sec-2-7}

\textbf{Software Developer}, Isomni Solutions Inc., Fredericton, New Brunswick

I developed an e-learning course management solution (iLearn).  I also designed and developed web-based user interface and a reference manual.
\section{Education}
\label{sec-3}
\subsection{December 2006 - May 2009}
\label{sec-3-1}

\textbf{Master of Computer Science}, Specializing in data representation and visualization for pattern recognition and machine learning.
\subsection{Institution}
\label{sec-3-2}

University of New Brunswick
\subsection{September 2000 - May 2005}
\label{sec-3-3}

\textbf{Bachelor of Computer Science}, \href{http://www.unb.ca/fredericton/cs/undergrad/bcs/index.html}{Co-op}, Honours and designated Major in Software Systems
\subsection{Institution}
\label{sec-3-4}

University of New Brunswick
\section{Active Projects}
\label{sec-4}
\subsection{RuleML PSOA}
\label{sec-4-1}

I am an active contributor to the \href{http://ruleml.org/#PSOA}{RuleML PSOA specification} as part of the \href{http://reubenpeterpaul.github.com/PSOA-to-TPTP/}{PSOA2TPTP} project.
\section{Selected Technical Skills and Abilities}
\label{sec-5}
\subsection{Programming Languages}
\label{sec-5-1}


\emph{General:}
   Java, Haskell, Lisp, Clojure, C/C++, Objective-C

\emph{Logic:}
   Prolog, JBoss Drools, PSOA RuleML

\label{systems-scripting}
\label{scripting}

\emph{Markup:}
   HTML5, \LaTeX{}, Markdown, Restructured Text, HAML, SASS

\emph{Scripting:}
   JavaScript, Ruby, PL/SQL, BASH


\begin{quote}
\emph{Learning: Clojure, Erlang, Scala}
\end{quote}
\subsection{Software Engineering}
\label{sec-5-2}
\label{software-engineering}
\label{integration}
\label{API}
\label{architecture}


\emph{Architectural Styles:}
    REST, Web Services, Message Queue, MVC, Pipeline

\emph{Development Methodologies:}
    Agile, Extreme Programming (XP), Scrum, TDD/BDD

\emph{APIs:}
    J2EE, JAX-RS, JPA, JMS, Java Servlet, OSGI, JADE

\emph{Frameworks:}
    jQuery, Rails, Flex, Adhearsion, Jersey, RESTEasy, ANTLR, Parsec

\label{mobile-application-development}

\emph{Mobile Platform:}
iOS, Android

\label{automation}

\emph{Automation:}
Jenkins, Maven, Ant, Automake, xUnit, Cucumber, RSpec

\label{telephony}

\emph{Telephony:} Asterisk, Festival TTS
\subsection{Servers}
\label{sec-5-3}

\emph{Web:} Apache HTTP, Tomcat, Mongrel, Node.js, Jetty, Snap

\emph{Stacks:} JBoss, JMX, Equinox, SpringSource dm Server, JADE

\emph{Telephony:} Asterisk

\label{database-management}

\emph{Database:} MySQL, Oracle, PostgreSQL, SQLite, MongoDB, BigTable

\emph{Version Control:} Git, Subversion

\emph{Repository:} Apache Ivy, Sonatype Nexus
\subsection{Authoring}
\label{sec-5-4}

\emph{Code:} emacs, vim, eclipse, Xcode, Matlab

\emph{Text:} Org Mode, ScribTeX, Sphinx
\label{statistical-analysis}

\emph{Statistical Analysis:} Org-R, R

\emph{Diagrams:} Graphviz, UMLet, Visio
\section{Personal Information}
\label{sec-6}
\subsection{Interests and Hobbies}
\label{sec-6-1}


\begin{description}
\item[Personal] family, hunting, archery, chess, snow boarding, board games, music
\item[Professional] emacs, functional programming, web APIs, cloud computing, security
\item[Scientific] category theory, $\lambda$ calculus, $\pi$ calculus, proof-carrying code, knowledge/data visualization
\end{description}
\subsection{Source Code Repositories}
\label{sec-6-2}


\href{https://github.com/reubenPeterPaul}{GitHub}, \href{http://code.google.com/u/101676264568220935370/}{Google Code}
\section{Awards and Recognition}
\label{sec-7}
\subsection{May 2010}
\label{sec-7-1}

   \textbf{KIRA, Technological Advancement and Innovation in the Private Sector}, our team was recognized for our automatic vehicle location platform developed in partnership with \href{http://redballinternet.com}{Red Ball Internet}.
\subsection{August 2008}
\label{sec-7-2}

   \textbf{Post Secondary Education Achievement}, I was recognized by the Pabineau First Nation community for successfully obtaining a master's degree in Computer Science.
\section{References}
\label{sec-8}

\emph{Available upon request.}

\end{document}
